function checkProbabilityTheory(count) {
  // змінні для парних та непарних чисел
  let even = 0;
  let odd = 0;
  // цикл, який повторюється count разів
  for (let i = 0; i < count; i++) {
  // змінна, яка зберігає випадкове число в діапазоні від 100 до 1000 включно
  let number = Math.floor(Math.random() * 901 + 100);
  // перевірка чи число парне
  if (number % 2 == 0) {
  // якщо число парне, то збільшуємо кількість парних чисел на 1
  even++;
  } else {
  // якщо число непарне, то збільшуємо кількість непарних чисел на 1
  odd++;
  }
  }
  // змінна, яка зберігає відсоткове співвідношення парних до непарних чисел
  let ratio = even / odd * 100;
  // виводимо інформацію в консоль
  console.log("Кількість згенерованих чисел: " + count);
  console.log("Парних чисел: " + even);
  console.log("Непарних чисел: " + odd);
  console.log("Відсоток парних до непарних: " + ratio.toFixed(2) + "%"); // для читабельності вивід відсотка з точністю 2 знаки після коми
  }
  
  // Перевірки
  checkProbabilityTheory(100); // рандомний вивід
  checkProbabilityTheory(999); // рандомний вивід
  checkProbabilityTheory(0); // загальна - 0, парні - 0, непарні - 0, відсоток - NaN%