function drawTriangle(height, symbol) {
    // рядок, який буде виводитися в консоль
    let line = "";
    // цикл, який повторюється height разів
    for (let i = 1; i <= height; i++) {
    // додаємо symbol, i разів, використовуючи метод repeat
    line += symbol.repeat(i);
    // додаємо символ переносу рядка, щоб почати новий рядок
    line += "\n";
    }
    // виводимо в консоль
    console.log(line);
    }
    
    // викликаємо функцію з різними параметрами
    drawTriangle(7, "*"); // намалює трикутник із зірочок висотою 7
    drawTriangle(5, "+"); // намалює трикутник із плюсиків висотою 5
    drawTriangle(3, "@"); // намалює трикутник із собачок висотою 3