function drawTriangle(height, symbol) {
    // рядок, який буде виводитися в консоль
    let line = "";
    // цикл, який повторюється height разів
    for (let i = 1; i <= height; i++) {
    // додаємо symbol, i разів
    for (let j = 1; j <= i; j++) {
    line += symbol;
    }
    // додаємо символ переносу рядка, щоб почати новий рядок
    line += "\n";
    }
    // виводимо в консоль
    console.log(line);
    }
    
    // викликаємо функцію з різними параметрами
    drawTriangle(3, "*"); // намалює трикутник із зірочок висотою 3
    drawTriangle(4, "+"); // намалює трикутник із плюсиків висотою 4
    drawTriangle(5, "@"); // намалює трикутник із собачок висотою 5